package Constants;

/**
 * Класс, хранящий константные значения
 */
public class Const {

    public static final String BOT_TOKEN = "522275875:AAFNsGlbSzvioBRT3e3uRIxrwj03H5YzcCk"; //Токен бота

    public static final String BOT_USERNAME = "Bulbash3r Bot"; //Имя бота

    public static final String[] STICKER = {
            "CAADAgADAQADqCIbEo_tyLxW-GDrAg",
            "CAADAgADAgADqCIbEhZIzEOaArMbAg",
            "CAADAgADAwADqCIbEgorrzElmtpiAg",
            "CAADAgADBAADqCIbEjaKOICKdjVOAg",
            "CAADAgADBQADqCIbEjn7O7Ry7M5-Ag",
            "CAADAgADBwADqCIbErum2jHga5g-Ag",
            "CAADAgADCAADqCIbEg8C29F_fzVAAg",
            "CAADAgADCQADqCIbEnFjZ92OisebAg",
            "CAADAgADDAADqCIbEv5phAABnJDVhQI",
            "CAADAgADDQADqCIbEl--ewMVon3kAg",
            "CAADAgADDgADqCIbEnkAAaUciwrDbAI",
            "CAADAgADIwADqCIbEsx1mIYnyRURAg"};

    public static final String[] HELLO = {"Дороу", "Привет", "Хаюшки"}; //Массив приветствий

    public static final String[] QUOTE = {"Дибилы", "звучит как угроза","Знает кто как заходить на iis БГУИР?",
            "ты сравниваешь машину и скейтборд", "В каждом есть дерьмо. Его ещё принято называть личностью или персональностью",
            "лучше го пивка потом выпьем","Не знаю, ни одного по-настоящему хорошего человека",
            "смешной такой", "+\\","харе стебаться","а вообще, все нужно делать в прикол",
            "я Злата брат",
            "Писка",
            "программируй на своем питоне",
            "теперь я знаю, что делать, когда до меня доебался Педрушкевич",
            "го дискуссию",
            "книги бесполезная трата времени",
            "что годного по линухе почитать?",
            "Сергей Шемпелевич",
            "Console.log('как дела');",
            "кодь под грушу",
            "бляяяяяяяяяяять",
            "Не сказал бы что умение прогать == знанию С",
            "короче, есть массив 2d (не тян), нужно взять колво строк",
            "вот коболь жопа",
            "хотел порешать ctf и пописать метру -> смотрю 7-ую серию подряд)",
            "я так и не разобрался \n" +
                    "забил",
            "ну если ты можешь посмотреть уроки видео и сразу кодить, то респект тебе\n" +
                    "я так не могу",
            "привет, человек",
            "так что такое аилофт",
            "(если кому смешно, это тру)",
            "существует мнение, что возможно в X-боксах присутствуют слабости",
            "Бывалый",
            "это как-то кхм.",
            "Интересно ты свои комплексы скрываешь, Юрэвич",
            "глупый вопрос",
            "Хм, человек-клещ прыгал бы метров на 50-100",
            "выборы, выборы\n" +
                    "кандидаты в старосты",
            "а может мне попробовать версию старньше 16.04",
            "жизнь воообще боль",
            "бля, все бы сча отдал за линукс",
            "Меня под 4 машинкой стригли",
            "завтра праздник еще буде?",
            "У кого есть список литературы по аокт?",
            "умирать совершеннее чем жить",
            "делфи говно",
            "ясненько, людей мы не уважаем",
            "кто ещё кроме Оношко действительно что-то добился",
            "почему ты так рьяно защищаешь поит",
            "Поит и вмсис братья почти",
            "но в мыслях он мне постоянно ебало начищает",
            "ПЛИСКАСОСИСКА",
            "Я че еблан?",
            "огурчик, попрошу",
            "вмсис ведь не тупой читать вики?",
            "Звёзд в void должно быть столько же скока их во вселенной",
            "сидел кто на тарифах семья лайф",
            "(заткните АНТОСЯ мне рил плевать)",
            "на пересдачу",
            "вроде все логично",
            "так, это сстеб Азарова, или рил так",
            "Хули он такой агрессивенвй",
            "Вы че ебланы?",
            "что юзаете чтобы взбродрится?",
            "вообще js классная штука",
            "Я один такой\n" +
                    "Других таких как я нет\n" +
                    "Я личность",
            "бля, голова уже не работает",
            "я понял процентов 60 слов",
            "скоро должно отпустить",
            "Придумал супералгоритм",
            "туса без расширенных жоп"};

    private static final String[] MEMES = {"https://pp.userapi.com/c846322/v846322926/52aa/U0upTVS2_OU.jpg",
            "https://pp.userapi.com/c847219/v847219419/8aab/5eij9gNUCQQ.jpg",
            "https://pp.userapi.com/c639425/v639425192/36b27/c2mGbIGaqEs.jpg",
            "https://sun9-3.userapi.com/c831209/v831209872/52bfb/dtE4JKp3NkE.jpg",
            "https://sun9-5.userapi.com/c840727/v840727938/66fad/c82Si8kLmyM.jpg",
            "https://pp.userapi.com/c7002/v7002111/4421e/caw8TQl7lBo.jpg",
            "https://sun9-2.userapi.com/c840728/v840728121/5abe1/YhTjAPqj2ao.jpg",
            "https://sun9-4.userapi.com/c840534/v840534452/2bcdb/FN5aRjKo0ps.jpg",
            "https://pp.userapi.com/c639123/v639123170/e743/KYR40PKpIR4.jpg",
    };
}
